# IsNameUnique Method (String)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HVACLoadBuildingType..::..IsNameUnique Method (String)
HVACLoadBuildingType Class See Also
---
Determines whether a potential building type name is unique.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public bool IsNameUnique(
	string name
)
```

Visual Basic
---
```text
Public Function IsNameUnique ( _
	name As String _
) As Boolean
```

Visual C++
---
```text
public:
bool IsNameUnique(
	String^ name
)
```

# ### Parameters
name
    Type: System..::..String The candidate name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
HVACLoadBuildingType Class
IsNameUnique Overload
Autodesk.Revit.DB.Analysis Namespace